app/controllers/quotes_controller.rb

  def index
    @quotes = current_company.quotes.ordered
---
SELECT "quotes".* FROM "quotes"

  def create
    @quote = current_company.quotes.build(quote_params)

    if @quote.save
---
INSERT INTO "quotes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "quote_a"], ["created_at", "2023-06-04 06:51:15.661285"], ["updated_at", "2023-06-04 06:51:15.661285"]]

  def update
    if @quote.update(quote_params)
---
UPDATE "quotes" SET "name" = $1, "updated_at" = $2 WHERE "quotes"."id" = $3  [["name", "Updated quote"], ["updated_at", "2023-06-04 06:45:53.911776"], ["id", 309456473]]

  def set_quote
    @quote = current_company.quotes.find(params[:id])
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]